Revit 2027 API
DocumentWorksharingEnabledEventArgs Class
 The event arguments used by the DocumentWorksharingEnabled event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentWorksharingEnabledEventArgs : RevitAPISingleEventArgs
Public Class DocumentWorksharingEnabledEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DocumentWorksharingEnabledEventArgs : public RevitAPISingleEventArgs
type DocumentWorksharingEnabledEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDocument |  Returns document associated with this event
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace